Autodesk.Revit.DB.CustomFieldValueComputaionResult
Describes the result of the computation of the value for a list of schedule items.

Autodesk.Revit.DB.CustomFieldValueComputaionResult.ItemsHaveDifferentValues
The value can't be computed because the items have different values. In this case in the schedule cell will be written a text that indicates that the items have different values.

Autodesk.Revit.DB.CustomFieldValueComputaionResult.ItemsDontHaveValue
The value can't be computed because the items don't have a value. In this case the schedule cell will be empty.

Autodesk.Revit.DB.CustomFieldValueComputaionResult.Success
The value was computed successfully. In this case the value will be shown in the schedule.